{
  "posts": [
    {
      "title": "JavaScript",
      "image": "https://1.bp.blogspot.com/-pdqcVeIQp64/XDX7TzdRdcI/AAAAAAAAM8E/ZmGuB6caZqIGmEflGHcj3zgXJJrmqRLdgCLcBGAs/w1200-h630-p-k-no-nu/Free%2BCourses%2Bto%2Blearn%2BJavaScript.jpg",
      "content": "JavaScript (/ˈdʒɑːvəskrɪpt/), often abbreviated as JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS. As of 2022, 98% of websites use JavaScript on the client side for webpage behavior, often incorporating third-party libraries. All major web browsers have a dedicated JavaScript engine to execute the code on users' devices.\n\nJavaScript is a high-level, often just-in-time compiled language that conforms to the ECMAScript standard.[10] It has dynamic typing, prototype-based object-orientation, and first-class functions. It is multi-paradigm, supporting event-driven, functional, and imperative programming styles. It has application programming interfaces (APIs) for working with text, dates, regular expressions, standard data structures, and the Document Object Model (DOM).\n\nThe ECMAScript standard does not include any input/output (I/O), such as networking, storage, or graphics facilities. In practice, the web browser or other runtime system provides JavaScript APIs for I/O.\n\nJavaScript engines were originally used only in web browsers, but are now core components of some servers and a variety of applications. The most popular runtime system for this usage is Node.js.\n\nAlthough Java and JavaScript are similar in name, syntax, and respective standard libraries, the two languages are distinct and differ greatly in design.",
      "date": "08-02-2023 16:22",
      "id": 5,
      "commentCount": 3,
      "comments": [
        {
          "id": "ecc20330-4847-42a0-82c1-4aa50c9144e7",
          "comment": "Šitas ir jāzin!",
          "author": "Jānis",
          "date": "09-02-2023 10:57"
        },
        {
          "id": "c7a50473-17a9-4d45-8671-89e4dce61aae",
          "comment": "Jā!",
          "author": "Kāds",
          "date": "09-02-2023 10:57"
        },
        {
          "id": "ce9786ee-efee-49bb-ad4e-63318e4b7707",
          "comment": "Tas ir easy...",
          "author": "Zigfrīds",
          "date": "09-02-2023 11:25"
        }
      ]
    },
    {
      "title": "HTML",
      "image": "https://www.oxfordwebstudio.com/user/pages/06.da-li-znate/sta-je-html/sta-je-html.jpg",
      "content": "The HyperText Markup Language or HTML is the standard markup language for documents designed to be displayed in a web browser. It can be assisted by technologies such as Cascading Style Sheets (CSS) and scripting languages such as JavaScript.\n\nWeb browsers receive HTML documents from a web server or from local storage and render the documents into multimedia web pages. HTML describes the structure of a web page semantically and originally included cues for the appearance of the document.\n\nHTML elements are the building blocks of HTML pages. With HTML constructs, images and other objects such as interactive forms may be embedded into the rendered page. HTML provides a means to create structured documents by denoting structural semantics for text such as headings, paragraphs, lists, links, quotes, and other items. HTML elements are delineated by tags, written using angle brackets. Tags such as <img /> and <input /> directly introduce content into the page. Other tags such as <p> surround and provide information about document text and may include other tags as sub-elements. Browsers do not display the HTML tags but use them to interpret the content of the page.\n\nHTML can embed programs written in a scripting language such as JavaScript, which affects the behavior and content of web pages. The inclusion of CSS defines the look and layout of content. The World Wide Web Consortium (W3C), former maintainer of the HTML and current maintainer of the CSS standards, has encouraged the use of CSS over explicit presentational HTML since 1997.[2] A form of HTML, known as HTML5, is used to display video and audio, primarily using the <canvas> element, in collaboration with JavaScript.",
      "date": "08-02-2023 17:10",
      "id": 7
    },
    {
      "title": "React",
      "image": "https://codetru.com/images/all/react-cards.jpg",
      "content": "React (also known as React.js or ReactJS) is a free and open-source front-end JavaScript library[3] for building user interfaces based on UI components. It is maintained by Meta (formerly Facebook) and a community of individual developers and companies.[4][5][6] React can be used as a base in the development of single-page, mobile, or server-rendered applications with frameworks like Next.js. However, React is only concerned with the user interface and rendering components to the DOM, so creating React applications usually requires the use of additional libraries for routing, as well as certain client-side functionality.",
      "date": "08-02-2023 17:11",
      "id": 8,
      "commentCount": 1,
      "comments": [
        {
          "id": "91b58efe-f9a1-4e9c-9e98-371928295926",
          "comment": "How do you invalidate a react query?",
          "author": "Someone",
          "date": "09-02-2023 11:01"
        }
      ]
    },
    {
      "title": "CSS",
      "image": "https://colorlib.com/wp/wp-content/uploads/sites/2/creative-css3-tutorials.jpg",
      "content": "Cascading Style Sheets (CSS) is a style sheet language used for describing the presentation of a document written in a markup language such as HTML or XML (including XML dialects such as SVG, MathML or XHTML).[1] CSS is a cornerstone technology of the World Wide Web, alongside HTML and JavaScript.[2]\n\nCSS is designed to enable the separation of content and presentation, including layout, colors, and fonts.[3] This separation can improve content accessibility; provide more flexibility and control in the specification of presentation characteristics; enable multiple web pages to share formatting by specifying the relevant CSS in a separate .css file, which reduces complexity and repetition in the structural content; and enable the .css file to be cached to improve the page load speed between the pages that share the file and its formatting.\n\nSeparation of formatting and content also makes it feasible to present the same markup page in different styles for different rendering methods, such as on-screen, in print, by voice (via speech-based browser or screen reader), and on Braille-based tactile devices. CSS also has rules for alternate formatting if the content is accessed on a mobile device.[4]\n\nThe name cascading comes from the specified priority scheme to determine which style rule applies if more than one rule matches a particular element. This cascading priority scheme is predictable.\n\nThe CSS specifications are maintained by the World Wide Web Consortium (W3C). Internet media type (MIME type) text/css is registered for use with CSS by RFC 2318 (March 1998). The W3C operates a free CSS validation service for CSS documents.[5]\n\nIn addition to HTML, other markup languages support the use of CSS including XHTML, plain XML, SVG, and XUL.",
      "date": "08-02-2023 17:14",
      "id": 9,
      "commentCount": 2,
      "comments": [
        {
          "id": "09e81c0d-e3e7-4576-9a95-c6222e0555fe",
          "comment": "Nu bet šito vajag!",
          "author": "Jānis",
          "date": "09-02-2023 10:57"
        },
        {
          "id": "5e8cb5eb-5844-4bf4-9e69-c8c6297d2142",
          "comment": "Nu ja!",
          "author": "Kāds",
          "date": "09-02-2023 10:57"
        }
      ]
    }
  ]
}